app_api/app/Models/ProductsModel.php

SELECT COUNT(*) AS `numrows`
FROM `products`
---

			// Count or get results
			if (isset($params['count']) && $params['count']) {
				return $builder->countAllResults();