app_api/app/Models/UserModel.php

SELECT `users`.*, `roles`.`name` as `role`
FROM `users`
LEFT JOIN `user_roles` as `roles` ON `roles`.`role_id` = `users`.`role_id`
WHERE `users`.`user_id` = '10002'
 LIMIT 1
---
		public function findByID($id)
		{
			$builder = $this->db->table($this->table);
			$builder->select($this->table . '.*,roles.name as role');
			$builder->join('user_roles as roles', 'roles.role_id = ' . $this->table . '.role_id', 'left');
			$builder->where($this->table . '.user_id', $id);
			$builder->limit(1);
			$result = $builder->get()->getResultArray();