app_api/app/Models/UserRoleModel.php

SELECT `user_roles`.*
FROM `user_roles`
WHERE `user_roles`.`role_id` = 'Super Admin'
 LIMIT 1
---
		public function findByID($id)
		{
			$builder = $this->db->table($this->table);
			$builder->select($this->table . '.*');
			$builder->where($this->table . '.role_id', $id);
			$builder->limit(1);
			$result = $builder->get()->getResultArray();