app_api/app/Helpers/app_helper.php

		function sendOtp($user_id) {
			$model = null;
			$model = new \App\Models\UserModel();
			if($model){
				$user = $model->find($user_id);
				$otp = rand(100000, 999999);
				$user['otp'] = $otp;
				$user['otp_expiry'] = date('Y-m-d H:i:s', strtotime('+10 minutes'));
				$user['otp_attempts'] = 0;
				$AppConfig = new \Config\AppConfig();
				if ($AppConfig->twoFactorAuth['enabled']) {
					if($AppConfig->twoFactorAuth['send']['email']){
						//send otp to email
						$email = $user['email'];
					}
					if($AppConfig->twoFactorAuth['send']['sms']){
						//send otp to sms
						$phone = $user['phone'];
					}
					if($AppConfig->twoFactorAuth['send']['whatsapp']){
						//send otp to whatsapp
						$whatsapp = $user['phone'];
					}
					$model->update($user_id, $user);
---
SELECT *
FROM `users`
WHERE `users`.`user_id` = '10002'
UPDATE `users` SET `user_id` = '10002', `role_id` = '1', `full_name` = 'Admin', `phone` = '8788786675', `email` = 'admin@example.com', `password` = '$2y$10$PUH.D.77xV4R9F8e2SQbFuAf.jYwGoccGE1sSOKbdq69Kq2LidNDW', `status` = '1', `otp` = 965453, `otp_expiry` = '2025-10-09 18:15:32', `otp_attempts` = 0, `last_login_at` = '2025-10-08 18:42:14', `last_login_ip` = '127.0.0.1', `fcm_token` = 'firebase_fcm_token_here', `code` = '2025062213321533799', `language` = 'en', `profile_photo` = 'user_1755428256_a388dfd3965f6fb2ea2284b981c1e5ea.jpg', `created_by` = '0', `created_at` = '2025-06-22 13:28:12', `updated_by` = '10002', `updated_at` = '2025-10-09 17:50:18'
WHERE `users`.`user_id` IN ('10002')