app_api/app/Controllers/Auth.php

		public function login()
		{
			$data = array();
			if ($this->isPost()) {
				if ($this->AuthenticateApikey()) {
					$post = esc($this->getPost());
					$isvalid = true;
					if (!isset($post['phone']) || empty($post['phone'])) {
						$isvalid = false;
						$this->setError("Please enter your phone.");
					}
					else if ($isvalid && (!isset($post['password']) || empty($post['password']))) {
						$isvalid = false;
						$this->setError("Please enter the password.");
					}
					if ($isvalid) {
						$userModel = new UserModel();
						$user = $userModel->where('phone', $post['phone'])->first();
---
SELECT *
FROM `users`
WHERE `phone` = '9876543211'
 LIMIT 1

								if ($session_id > 0) {
									$param = array();
									$param['fcm_token'] = isset($post['fcm_token']) ? $post['fcm_token'] : '';
									$userModel->update($user['user_id'],$param);
---
UPDATE `users` SET `fcm_token` = 'firebase_fcm_token_here'
WHERE `users`.`user_id` IN ('10002')

		public function register()
		{
			if ($this->AuthenticateApikey()) {
				$userModel = new UserModel();
				if($this->isPost()){
					$post = esc($this->getPost());
					$isvalidrequest = true;
					$errors = "";
					// Validate required fields
					if (!isset($post['full_name']) || empty($post['full_name'])) {
						$this->setError("Please enter full name.");
						$isvalidrequest = false;
					}
					if ($isvalidrequest && (!isset($post['email']) || empty($post['email']))) {
						$this->setError("Please enter email.");
						$isvalidrequest = false;
					}
					if ($isvalidrequest && (!isset($post['phone']) || empty($post['phone']))) {
						$this->setError("Please enter phone.");
						$isvalidrequest = false;
					}
					if ($isvalidrequest && (!isset($post['password']) || empty($post['password']))) {
						$this->setError("Please enter password.");
						$isvalidrequest = false;
					}

					if($isvalidrequest){
						// Check if phone already exists
						$existingPhone = $userModel->where('phone', $post['phone'])->first();
---
SELECT *
FROM `users`
WHERE `phone` = '1234567890'
 LIMIT 1

						'updated_at' => $created_at
						);

						$user_id = $userModel->insert($values);
---
INSERT INTO `users` (`full_name`, `email`, `phone`, `password`, `role_id`, `status`, `language`, `profile_photo`, `created_by`, `created_at`, `updated_at`) VALUES ('John Doe', 'john.doe@example.com', '1234567891', '$2y$10$b3KeQNe2Cdu9qrOmTPYZ8OvqG1ExpL8b3zxZeBtwUdFL4B54xx8xi', '2', '1', 'en', '', 0, '2025-10-08 20:59:04', '2025-10-08 20:59:04')

		public function verify_otp()
		{
			if ($this->AuthenticateApikey()) {
				if ($this->isPost()) {
					$post = esc($this->getPost());
					$isvalid = true;
					if (!isset($post['phone']) || empty($post['phone'])) {
						$isvalid = false;
						$this->setError('Please enter your phone.');
					}
					else if (!isset($post['otp']) || empty($post['otp'])) {
						$isvalid = false;
						$this->setError('Please enter the OTP.');
					}
					if ($isvalid) {
						$userModel = new UserModel();
						$user = $userModel->where('phone', $post['phone'])->first();
---
SELECT *
FROM `users`
WHERE `phone` = '1234567890'
 LIMIT 1

								}
							} else {
								// Increment attempts on invalid OTP
								$userModel->update($user['user_id'], array(
									'otp_attempts' => isset($user['otp_attempts']) ? ((int)$user['otp_attempts'] + 1) : 1,
								));
---
UPDATE `users` SET `otp_attempts` = 1
WHERE `users`.`user_id` IN ('10006')