app_api/app/Controllers/Auth.php

									if ($session_id > 0) {
										$param = array();
										$param['fcm_token'] = isset($post['fcm_token']) ? $post['fcm_token'] : '';
										$userModel->update($user['user_id'],$param);
---
UPDATE `users` SET `fcm_token` = ''
WHERE `users`.`user_id` IN ('10002')